In [354]:
import sqlite3
import pandas as pd
import ast
import numpy as np
import os

In [355]:
os.chdir('/Users/alexa/Documents/subscriber-pipeline-starter-kit/dev/')

In [356]:
connect = sqlite3.connect('cademycode.db')
cursor = connection.cursor()
print("Connected to SQLite")

Connected to SQLite

In [357]:
table_list = [a for a in cursor.execute("SELECT name FROM sqlite_master WHERE type = 'table'")]
print(table_list)

[('cademycode_students',), ('cademycode_courses',), ('cademycode_student_jobs',)]

In [358]:
students = pd.read_sql_query("SELECT * FROM cademycode_students", connect)
courses = pd.read_sql_query("SELECT * FROM cademycode_courses", connect)
student_jobs = pd.read_sql_query("SELECT * FROM cademycode_student_jobs", connect)

In [359]:
print('Students:', len(students))
print('Courses:', len(courses))
print('Student Jobs:', len(student_jobs))

Students: 5000
Courses: 10
Student Jobs: 13

In [360]:
print(students.head(10))

   uuid                  name         dob sex  \
0     1       Annabelle Avery  1943-07-03   F
1     2           Micah Rubio  1991-02-07   M
2     3            Hosea Dale  1989-12-07   M
3     4          Mariann Kirk  1988-07-31   F
4     5       Lucio Alexander  1963-08-31   M
5     6      Shavonda Mcmahon  1989-10-15   F
6     7   Terrell Bleijenberg  1959-05-05   M
7     8        Stanford Allan  1997-11-22   M
8     9       Tricia Delacruz  1961-10-20   F
9    10  Regenia van der Helm  1999-02-23   N

                                        contact_info job_id num_course_taken  \
0  {"mailing_address": "303 N Timber Key, Irondal...    7.0              6.0
1  {"mailing_address": "767 Crescent Fair, Shoals...    7.0              5.0
2  {"mailing_address": "P.O. Box 41269, St. Bonav...    7.0              8.0
3  {"mailing_address": "517 SE Wintergreen Isle, ...    6.0              7.0
4  {"mailing_address": "18 Cinder Cliff, Doyles b...    7.0             14.0
5  {"mailing_address": "P.O. Box 81591, Tarpon Sp...    6.0             10.0
6  {"mailing_address": "P.O. Box 53471, Oskaloosa...    2.0              9.0
7  {"mailing_address": "255 Spring Avenue, Point ...    3.0              3.0
8  {"mailing_address": "997 Dewy Apple, Lake Lind...    1.0              6.0
9  {"mailing_address": "220 Middle Ridge, Falcon ...    5.0              7.0

  current_career_path_id time_spent_hrs
0                    1.0           4.99
1                    8.0            4.4
2                    8.0           6.74
3                    9.0          12.31
4                    3.0           5.64
5                    3.0          10.12
6                    8.0          24.17
7                    1.0          19.54
8                    9.0           1.75
9                    6.0          13.55

In [361]:
now = pd.to_datetime('now')

/var/folders/s4/rqrtd5990671hfxfct9834bc0000gn/T/ipykernel_64859/2819764614.py:1: FutureWarning: The parsing of 'now' in pd.to_datetime without `utc=True` is deprecated. In a future version, this will match Timestamp('now') and Timestamp.now()
  now = pd.to_datetime('now')

In [362]:
students['age'] = (now - pd.to_datetime(students['dob'])).astype('<m8[Y]')

In [363]:
students['age_group'] = np.int64((students['age']/10))*10

In [364]:
students.head()

,uuid,name,dob,sex,contact_info,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group
0,1,Annabelle Avery,1943-07-03,F,"{""mailing_address"": ""303 N Timber Key, Irondal...",7.0,6.0,1.0,4.99,80.0,80
1,2,Micah Rubio,1991-02-07,M,"{""mailing_address"": ""767 Crescent Fair, Shoals...",7.0,5.0,8.0,4.4,32.0,30
2,3,Hosea Dale,1989-12-07,M,"{""mailing_address"": ""P.O. Box 41269, St. Bonav...",7.0,8.0,8.0,6.74,33.0,30
3,4,Mariann Kirk,1988-07-31,F,"{""mailing_address"": ""517 SE Wintergreen Isle, ...",6.0,7.0,9.0,12.31,35.0,30
4,5,Lucio Alexander,1963-08-31,M,"{""mailing_address"": ""18 Cinder Cliff, Doyles b...",7.0,14.0,3.0,5.64,60.0,60

In [365]:
students['contact_info'] = students['contact_info'].apply(lambda x: ast.literal_eval(x))
explode_contact = pd.json_normalize(students['contact_info'])

students = pd.concat([students.drop('contact_info', axis=1), explode_contact], axis=1)

In [366]:
students.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,mailing_address,email
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,80.0,80,"303 N Timber Key, Irondale, Wisconsin, 84736",annabelle_avery9376@woohoo.com
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.4,32.0,30,"767 Crescent Fair, Shoals, Indiana, 37439",rubio6772@hmail.com
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,33.0,30,"P.O. Box 41269, St. Bonaventure, Virginia, 83637",hosea_dale8084@coldmail.com
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,35.0,30,"517 SE Wintergreen Isle, Lane, Arkansas, 82242",kirk4005@hmail.com
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,60.0,60,"18 Cinder Cliff, Doyles borough, Rhode Island,...",alexander9810@hmail.com

In [367]:
split_address = students['mailing_address'].str.split(',', expand=True)
split_address.columns = ['street', 'city', 'state', 'zip_code']

students = pd.concat([students.drop('mailing_address', axis=1), split_address], axis=1)
students.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,80.0,80,annabelle_avery9376@woohoo.com,303 N Timber Key,Irondale,Wisconsin,84736
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.4,32.0,30,rubio6772@hmail.com,767 Crescent Fair,Shoals,Indiana,37439
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,33.0,30,hosea_dale8084@coldmail.com,P.O. Box 41269,St. Bonaventure,Virginia,83637
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,35.0,30,kirk4005@hmail.com,517 SE Wintergreen Isle,Lane,Arkansas,82242
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,60.0,60,alexander9810@hmail.com,18 Cinder Cliff,Doyles borough,Rhode Island,73737

In [368]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   job_id                  4995 non-null   object
 5   num_course_taken        4749 non-null   object
 6   current_career_path_id  4529 non-null   object
 7   time_spent_hrs          4529 non-null   object
 8   age                     5000 non-null   float64
 9   age_group               5000 non-null   int64
 10  email                   5000 non-null   object
 11  street                  5000 non-null   object
 12  city                    5000 non-null   object
 13  state                   5000 non-null   object
 14  zip_code                5000 non-null   object
dtypes: float64(1), int64(2), object(12)
memory usage: 586.1+ KB

In [369]:
students['job_id'] = students['job_id'].astype(float)
students['num_course_taken'] = students['num_course_taken'].astype(float)
students['current_career_path_id'] = students['current_career_path_id'].astype(float)
students['time_spent_hrs'] = students['time_spent_hrs'].astype(float)

In [370]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    5000 non-null   int64
 1   name                    5000 non-null   object
 2   dob                     5000 non-null   object
 3   sex                     5000 non-null   object
 4   job_id                  4995 non-null   float64
 5   num_course_taken        4749 non-null   float64
 6   current_career_path_id  4529 non-null   float64
 7   time_spent_hrs          4529 non-null   float64
 8   age                     5000 non-null   float64
 9   age_group               5000 non-null   int64
 10  email                   5000 non-null   object
 11  street                  5000 non-null   object
 12  city                    5000 non-null   object
 13  state                   5000 non-null   object
 14  zip_code                5000 non-null   object
dtypes: float64(5), int64(2), object(8)
memory usage: 586.1+ KB

# Handling Missing Data

In [371]:
missing_course_taken = students[students[['num_course_taken']].isnull().any(axis=1)]
display(missing_course_taken)

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code
25,26,Doug Browning,1970-06-08,M,7.0,NaN,5.0,1.92,53.0,50,doug7761@inlook.com,P.O. Box 15845,Devine,Florida,23097
26,27,Damon Schrauwen,1953-10-31,M,4.0,NaN,10.0,3.73,69.0,60,damon9864@woohoo.com,P.O. Box 84659,Maben,Georgia,66137
51,52,Alisa Neil,1977-05-28,F,5.0,NaN,8.0,22.86,46.0,40,alisa9616@inlook.com,16 View Annex,Mosses,North Dakota,25748
70,71,Chauncey Hooper,1962-04-07,M,3.0,NaN,3.0,3.97,61.0,60,chauncey6352@woohoo.com,955 Dewy Flat,Slaughterville,South Carolina,22167
80,81,Ellyn van Heest,1984-06-28,F,3.0,NaN,10.0,12.39,39.0,30,ellyn_vanheest8375@hmail.com,872 Cider Glade,Chicken,Delaware,42689
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4889,4890,Tegan Cochran,1970-11-08,F,5.0,NaN,8.0,22.75,52.0,50,tegan130@inlook.com,106 Sunny Nook,Vernal,Georgia,10769
4898,4899,Ruthann Oliver,1998-05-22,F,3.0,NaN,7.0,21.27,25.0,20,ruthann1124@woohoo.com,644 Merry Island,Green Valley,Wyoming,91273
4914,4915,Ernest Holmes,1995-03-11,M,7.0,NaN,9.0,26.50,28.0,20,ernest_holmes505@hmail.com,872 Wintergreen Harbor,Gallitzin borough,Maine,50103
4980,4981,Brice Franklin,1946-12-01,M,4.0,NaN,5.0,8.66,76.0,70,brice9741@coldmail.com,947 Panda Way,New Bedford village,Vermont,31232
4985,4986,Russel Vonck,1994-09-07,M,5.0,NaN,5.0,16.44,28.0,20,russel_vonck2834@woohoo.com,815 Middle Timber Corner,Clawson,South Dakota,02949

In [372]:
missing_data = pd.DataFrame()
missing_data = pd.concat([missing_data, missing_course_taken])
students = students.dropna(subset=['num_course_taken'])

In [373]:
students.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4749 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    4749 non-null   int64
 1   name                    4749 non-null   object
 2   dob                     4749 non-null   object
 3   sex                     4749 non-null   object
 4   job_id                  4744 non-null   float64
 5   num_course_taken        4749 non-null   float64
 6   current_career_path_id  4298 non-null   float64
 7   time_spent_hrs          4298 non-null   float64
 8   age                     4749 non-null   float64
 9   age_group               4749 non-null   int64
 10  email                   4749 non-null   object
 11  street                  4749 non-null   object
 12  city                    4749 non-null   object
 13  state                   4749 non-null   object
 14  zip_code                4749 non-null   object
dtypes: float64(5), int64(2), object(8)
memory usage: 593.6+ KB

In [375]:
missing_job_id = students[students[['job_id']].isnull().any(axis=1)]
missing_job_id.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code
162,163,Glen Riley,2002-08-22,M,NaN,8.0,3.0,5.70,21.0,20,glen_riley4484@hmail.com,P.O. Box 37267,Cornlea village,Tennessee,19192
757,758,Mercedez Vorberg,2002-03-25,F,NaN,15.0,4.0,4.14,21.0,20,mercedez6297@woohoo.com,284 Cedar Seventh,Virden village,Washington,60489
854,855,Kurt Ho,2002-05-29,M,NaN,0.0,8.0,23.72,21.0,20,ho6107@inlook.com,P.O. Box 27254,Olin,New Hampshire,60067
1029,1030,Penny Gaines,2002-03-01,N,NaN,15.0,4.0,16.25,21.0,20,gaines2897@hmail.com,138 Misty Vale,Stockton borough,West Virginia,53630
1542,1543,Frederick Reilly,2002-11-13,M,NaN,7.0,9.0,21.32,20.0,20,frederick_reilly6971@woohoo.com,P.O. Box 40769,Quakervillage,Maryland,96218

In [376]:
missing_data = pd.concat([missing_data, missing_job_id])
students = students.dropna(subset=['job_id'])

In [377]:
students.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4744 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    4744 non-null   int64
 1   name                    4744 non-null   object
 2   dob                     4744 non-null   object
 3   sex                     4744 non-null   object
 4   job_id                  4744 non-null   float64
 5   num_course_taken        4744 non-null   float64
 6   current_career_path_id  4293 non-null   float64
 7   time_spent_hrs          4293 non-null   float64
 8   age                     4744 non-null   float64
 9   age_group               4744 non-null   int64
 10  email                   4744 non-null   object
 11  street                  4744 non-null   object
 12  city                    4744 non-null   object
 13  state                   4744 non-null   object
 14  zip_code                4744 non-null   object
dtypes: float64(5), int64(2), object(8)
memory usage: 593.0+ KB

In [380]:
missing_career_path_id = students[students[['current_career_path_id']].isnull().any(axis=1)]
display(missing_career_path_id)

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code
15,16,Norene Dalton,1976-04-30,F,6.0,0.0,NaN,NaN,47.0,40,norene_dalton9509@hmail.com,130 Wishing Essex,Branch,Ohio,13616
19,20,Sofia van Steenbergen,1990-02-21,N,7.0,13.0,NaN,NaN,33.0,30,vansteenbergen8482@inlook.com,634 Clear Barn Dell,Beaman,Georgia,33288
30,31,Christoper Warner,1989-12-28,M,2.0,5.0,NaN,NaN,33.0,30,warner5906@coldmail.com,556 Stony Highlands,Drain,Illinois,01973
49,50,Antony Horne,1996-05-29,M,3.0,2.0,NaN,NaN,27.0,20,antony577@coldmail.com,P.O. Box 78685,Lenox,Texas,15516
54,55,Omar Bunk,1955-11-08,M,3.0,14.0,NaN,NaN,67.0,60,omar1245@coldmail.com,445 Dale Hollow,Vermont village,South Carolina,28329
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4904,4905,Eduardo Daniel,2004-06-18,M,8.0,12.0,NaN,NaN,19.0,10,daniel5073@inlook.com,598 Deer Trace,Forest Grove,North Carolina,45038
4922,4923,Francisco van Ede,1961-04-26,M,7.0,5.0,NaN,NaN,62.0,60,vanede7845@coldmail.com,282 Fourth Trace,Carter Lake,Ohio,63511
4948,4949,Dewitt van Malsem,1949-03-08,M,4.0,7.0,NaN,NaN,74.0,70,dewitt4635@inlook.com,423 Course Trail,Wilmot,Hawaii,18996
4956,4957,Todd Stamhuis,1961-06-15,M,7.0,8.0,NaN,NaN,62.0,60,todd8019@woohoo.com,251 Grand Rose Underpass,Niagara,Pennsylvania,03430
4974,4975,Jorge Creelman,1944-11-24,M,2.0,15.0,NaN,NaN,78.0,70,jorge_creelman8261@coldmail.com,919 Well Overpass,Lindenhurst village,Maine,33548

In [381]:
missing_career_path_id.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 451 entries, 15 to 4974
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    451 non-null    int64
 1   name                    451 non-null    object
 2   dob                     451 non-null    object
 3   sex                     451 non-null    object
 4   job_id                  451 non-null    float64
 5   num_course_taken        451 non-null    float64
 6   current_career_path_id  0 non-null      float64
 7   time_spent_hrs          0 non-null      float64
 8   age                     451 non-null    float64
 9   age_group               451 non-null    int64
 10  email                   451 non-null    object
 11  street                  451 non-null    object
 12  city                    451 non-null    object
 13  state                   451 non-null    object
 14  zip_code                451 non-null    object
dtypes: float64(5), int64(2), object(8)
memory usage: 56.4+ KB

In [382]:
students['current_career_path_id'].unique()

array([ 1.,  8.,  9.,  3.,  6., 10.,  5., nan,  4.,  7.,  2.])

In [384]:
students['current_career_path_id'] = np.where(students['current_career_path_id'].isnull(), 0, students['current_career_path_id'])
students['time_spent_hrs'] = np.where(students['time_spent_hrs'].isnull(), 0, students['time_spent_hrs'])

In [385]:
students.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4744 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    4744 non-null   int64
 1   name                    4744 non-null   object
 2   dob                     4744 non-null   object
 3   sex                     4744 non-null   object
 4   job_id                  4744 non-null   float64
 5   num_course_taken        4744 non-null   float64
 6   current_career_path_id  4744 non-null   float64
 7   time_spent_hrs          4744 non-null   float64
 8   age                     4744 non-null   float64
 9   age_group               4744 non-null   int64
 10  email                   4744 non-null   object
 11  street                  4744 non-null   object
 12  city                    4744 non-null   object
 13  state                   4744 non-null   object
 14  zip_code                4744 non-null   object
dtypes: float64(5), int64(2), object(8)
memory usage: 593.0+ KB

# Working with Courses Table

In [389]:
display(courses)

   career_path_id           career_path_name  hours_to_complete
0               1             data scientist                 20
1               2              data engineer                 20
2               3               data analyst                 12
3               4       software engineering                 25
4               5           backend engineer                 18
5               6          frontend engineer                 20
6               7              iOS developer                 27
7               8          android developer                 27
8               9  machine learning engineer                 35
9              10             ux/ui designer                 15

In [390]:
courses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   career_path_id     10 non-null     int64
 1   career_path_name   10 non-null     object
 2   hours_to_complete  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 372.0+ bytes

In [391]:
not_applicable = {'career_path_id': 0,
                  'career_path_name': 'not applicable',
                  'hours_to_complete': 0}

courses.loc[len(courses)] = not_applicable

In [392]:
display(courses)

    career_path_id           career_path_name  hours_to_complete
0                1             data scientist                 20
1                2              data engineer                 20
2                3               data analyst                 12
3                4       software engineering                 25
4                5           backend engineer                 18
5                6          frontend engineer                 20
6                7              iOS developer                 27
7                8          android developer                 27
8                9  machine learning engineer                 35
9               10             ux/ui designer                 15
10               0             not applicable                  0

In [393]:
display(student_jobs)

    job_id        job_category  avg_salary
0        1           analytics       86000
1        2            engineer      101000
2        3  software developer      110000
3        4            creative       66000
4        5  financial services      135000
5        6           education       61000
6        7                  HR       80000
7        8             student       10000
8        9          healthcare      120000
9        0               other       80000
10       3  software developer      110000
11       4            creative       66000
12       5  financial services      135000

In [394]:
student_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   job_id        13 non-null     int64
 1   job_category  13 non-null     object
 2   avg_salary    13 non-null     int64
dtypes: int64(2), object(1)
memory usage: 444.0+ bytes

In [395]:
student_jobs.drop_duplicates(inplace=True)
display(students_jobs)

    job_id        job_category  avg_salary
0        1           analytics       86000
1        2            engineer      101000
2        3  software developer      110000
3        4            creative       66000
4        5  financial services      135000
5        6           education       61000
6        7                  HR       80000
7        8             student       10000
8        9          healthcare      120000
9        0               other       80000
10       3  software developer      110000
11       4            creative       66000
12       5  financial services      135000

# Joining Tables

In [396]:
final_df = students.merge(courses, left_on='current_career_path_id', right_on='career_path_id', how='left')

In [397]:
final_df = final_df.merge(student_jobs, on='job_id', how='left')

In [398]:
final_df.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code,career_path_id,career_path_name,hours_to_complete,job_category,avg_salary
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,80.0,80,annabelle_avery9376@woohoo.com,303 N Timber Key,Irondale,Wisconsin,84736,1,data scientist,20,HR,80000
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.40,32.0,30,rubio6772@hmail.com,767 Crescent Fair,Shoals,Indiana,37439,8,android developer,27,HR,80000
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,33.0,30,hosea_dale8084@coldmail.com,P.O. Box 41269,St. Bonaventure,Virginia,83637,8,android developer,27,HR,80000
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,35.0,30,kirk4005@hmail.com,517 SE Wintergreen Isle,Lane,Arkansas,82242,9,machine learning engineer,35,education,61000
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,60.0,60,alexander9810@hmail.com,18 Cinder Cliff,Doyles borough,Rhode Island,73737,3,data analyst,12,HR,80000

In [399]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4744 entries, 0 to 4743
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    4744 non-null   int64
 1   name                    4744 non-null   object
 2   dob                     4744 non-null   object
 3   sex                     4744 non-null   object
 4   job_id                  4744 non-null   float64
 5   num_course_taken        4744 non-null   float64
 6   current_career_path_id  4744 non-null   float64
 7   time_spent_hrs          4744 non-null   float64
 8   age                     4744 non-null   float64
 9   age_group               4744 non-null   int64
 10  email                   4744 non-null   object
 11  street                  4744 non-null   object
 12  city                    4744 non-null   object
 13  state                   4744 non-null   object
 14  zip_code                4744 non-null   object
 15  career_path_id          4744 non-null   int64
 16  career_path_name        4744 non-null   object
 17  hours_to_complete       4744 non-null   int64
 18  job_category            4744 non-null   object
 19  avg_salary              4744 non-null   int64
dtypes: float64(5), int64(5), object(10)
memory usage: 778.3+ KB

# Upsert Cleaned and Missing Data tables into new SQLite DB

In [413]:
sqlite_connection = sqlite3.connect('cademycode_cleansed.db')

In [414]:
final_df.to_sql('cademycode_aggregated', sqlite_connection, if_exists='replace', index=False)

4744

In [415]:
db_df = pd.read_sql_query("SELECT * FROM cademycode_aggregated", sqlite_connection)

In [416]:
db_df.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code,career_path_id,career_path_name,hours_to_complete,job_category,avg_salary
0,1,Annabelle Avery,1943-07-03,F,7.0,6.0,1.0,4.99,80.0,80,annabelle_avery9376@woohoo.com,303 N Timber Key,Irondale,Wisconsin,84736,1,data scientist,20,HR,80000
1,2,Micah Rubio,1991-02-07,M,7.0,5.0,8.0,4.40,32.0,30,rubio6772@hmail.com,767 Crescent Fair,Shoals,Indiana,37439,8,android developer,27,HR,80000
2,3,Hosea Dale,1989-12-07,M,7.0,8.0,8.0,6.74,33.0,30,hosea_dale8084@coldmail.com,P.O. Box 41269,St. Bonaventure,Virginia,83637,8,android developer,27,HR,80000
3,4,Mariann Kirk,1988-07-31,F,6.0,7.0,9.0,12.31,35.0,30,kirk4005@hmail.com,517 SE Wintergreen Isle,Lane,Arkansas,82242,9,machine learning engineer,35,education,61000
4,5,Lucio Alexander,1963-08-31,M,7.0,14.0,3.0,5.64,60.0,60,alexander9810@hmail.com,18 Cinder Cliff,Doyles borough,Rhode Island,73737,3,data analyst,12,HR,80000

In [417]:
db_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4744 entries, 0 to 4743
Data columns (total 20 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   uuid                    4744 non-null   int64
 1   name                    4744 non-null   object
 2   dob                     4744 non-null   object
 3   sex                     4744 non-null   object
 4   job_id                  4744 non-null   float64
 5   num_course_taken        4744 non-null   float64
 6   current_career_path_id  4744 non-null   float64
 7   time_spent_hrs          4744 non-null   float64
 8   age                     4744 non-null   float64
 9   age_group               4744 non-null   int64
 10  email                   4744 non-null   object
 11  street                  4744 non-null   object
 12  city                    4744 non-null   object
 13  state                   4744 non-null   object
 14  zip_code                4744 non-null   object
 15  career_path_id          4744 non-null   int64
 16  career_path_name        4744 non-null   object
 17  hours_to_complete       4744 non-null   int64
 18  job_category            4744 non-null   object
 19  avg_salary              4744 non-null   int64
dtypes: float64(5), int64(5), object(10)
memory usage: 741.4+ KB

In [418]:
missing_data.to_sql('incomplete_data', sqlite_connection, if_exists='replace', index=False)

256

In [419]:
missing_df = pd.read_sql_query("SELECT * FROM incomplete_data", sqlite_connection)

In [420]:
missing_df.head()

,uuid,name,dob,sex,job_id,num_course_taken,current_career_path_id,time_spent_hrs,age,age_group,email,street,city,state,zip_code
0,26,Doug Browning,1970-06-08,M,7.0,NaN,5.0,1.92,53.0,50,doug7761@inlook.com,P.O. Box 15845,Devine,Florida,23097
1,27,Damon Schrauwen,1953-10-31,M,4.0,NaN,10.0,3.73,69.0,60,damon9864@woohoo.com,P.O. Box 84659,Maben,Georgia,66137
2,52,Alisa Neil,1977-05-28,F,5.0,NaN,8.0,22.86,46.0,40,alisa9616@inlook.com,16 View Annex,Mosses,North Dakota,25748
3,71,Chauncey Hooper,1962-04-07,M,3.0,NaN,3.0,3.97,61.0,60,chauncey6352@woohoo.com,955 Dewy Flat,Slaughterville,South Carolina,22167
4,81,Ellyn van Heest,1984-06-28,F,3.0,NaN,10.0,12.39,39.0,30,ellyn_vanheest8375@hmail.com,872 Cider Glade,Chicken,Delaware,42689

In [421]:
sqlite_connection.close()

# Creating CSV File

In [422]:
db_df.to_csv('cademycode_cleansed.csv')